import { HistoriesResponse, StaycountsResponse } from "@/types";

export const labels = Array.from({ length: 24 }, (_, index) => `${index}時`);

export const staycountsResponse: StaycountsResponse = {
  staycounts: [
    {
      building: "1号館",
      floors: [
        {
          floor: 2,
          rooms: [
            { id: 100, name: "202", staycount: 13 },
            { id: 101, name: "201", staycount: 10 },
          ],
        },
        {
          floor: 1,
          rooms: [
            { id: 102, name: "アメリカフェ", staycount: 13 },
            { id: 103, name: "102", staycount: null },
            { id: 104, name: "101", staycount: 10 },
          ],
        },
        {
          floor: 3,
          rooms: [
            { id: 105, name: "301", staycount: 10 },
            { id: 106, name: "302", staycount: 13 },
          ],
        },
        {
          floor: 4,
          rooms: [
            { id: 107, name: "401", staycount: 10 },
            { id: 108, name: "402", staycount: 13 },
          ],
        },
        {
          floor: 5,
          rooms: [
            { id: 109, name: "501", staycount: 10 },
            { id: 110, name: "502", staycount: 13 },
          ],
        },
        {
          floor: 6,
          rooms: [
            { id: 111, name: "601", staycount: 10 },
            { id: 112, name: "602", staycount: 13 },
          ],
        },
      ],
    },
    {
      building: "10号館",
      floors: [
        {
          floor: 1,
          rooms: [
            { id: 1001, name: "101", staycount: 10 },
            { id: 1002, name: "102", staycount: 13 },
          ],
        },
        {
          floor: 2,
          rooms: [
            { id: 1003, name: "201", staycount: 10 },
            { id: 1004, name: "202", staycount: 13 },
          ],
        },
        {
          floor: 3,
          rooms: [
            { id: 1005, name: "301", staycount: 10 },
            { id: 1006, name: "302", staycount: 13 },
          ],
        },
        {
          floor: 4,
          rooms: [
            { id: 1007, name: "401", staycount: 10 },
            { id: 1008, name: "402", staycount: 13 },
          ],
        },
        {
          floor: 5,
          rooms: [
            { id: 1009, name: "501", staycount: 10 },
            { id: 1010, name: "502", staycount: 13 },
          ],
        },
        {
          floor: 6,
          rooms: [
            { id: 1011, name: "601", staycount: 10 },
            { id: 1012, name: "602", staycount: 13 },
          ],
        },
      ],
    },
    {
      building: "4号館",
      floors: [
        {
          floor: 1,
          rooms: [
            { id: 401, name: "401", staycount: 10 },
            { id: 402, name: "玉森研", staycount: 13 },
          ],
        },
        {
          floor: 2,
          rooms: [{ id: 403, name: "402", staycount: 10 }],
        },
        {
          floor: 3,
          rooms: [{ id: 405, name: "403", staycount: 10 }],
        },
        {
          floor: 4,
          rooms: [{ id: 407, name: "404", staycount: 10 }],
        },
      ],
    },
    {
      building: "4号館別館",
      floors: [
        {
          floor: 1,
          rooms: [{ id: 410, name: "梶研", staycount: 13 }],
        },
        {
          floor: 2,
          rooms: [{ id: 411, name: "暢浩研", staycount: 10 }],
        },
        {
          floor: 3,
          rooms: [
            { id: 412, name: "内藤研", staycount: 10 },
            { id: 412, name: "シス研", staycount: 10 },
          ],
        },
        {
          floor: 4,
          rooms: [{ id: 413, name: "慎士研", staycount: 10 }],
        },
      ],
    },
  ],
};

export const historiesResponse: HistoriesResponse = {
  histories: {
    "4": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "3": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "100": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "2": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "1": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "5": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "6": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "7": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "8": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "9": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "10": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "11": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "12": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "13": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "14": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "15": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "16": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "17": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "18": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "19": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "20": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "21": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "22": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "23": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
    "24": [
      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    ],
  },
};
